{
  "Header": {
    "links": {
      "projects": "Projects",
      "about": "About",
      "contacts": "Contacts"
    },
    "contacts": {
      "linkedin": "Linkedin",
      "github": "GitHub",
      "resume": "Resume"
    },
    "contacts_links": {
      "linkedin": "https://www.linkedin.com/in/victor-merseguel",
      "github": "https://github.com/victormerseguel",
      "resume": "/assets/en_resume_front-end_ATS.pdf"
    },
    "title": "🖐🏼 Hi there, i'm Victor Merseguel,",
    "subtitle_1": "a front end developer,",
    "subtitle_2": "passionate about the art of coding."
  },
  "Projects": {
    "title": "Projects",
    "projects": {},
    "project-link": "view project",
    "button": { "view": "View all", "hide": "View less" }
  },
  "About": {
    "title": "About me",
    "text": {
      "p1": "I am a Front-End Developer with a unique combination of technical skills and a refined artistic perspective. My journey began in the arts, where I graduated in Performing Arts and worked as a theater set designer and props artisan, earning prestigious awards in the field. This experience shaped my attention to detail and my ability to create visual solutions that balance form and functionality—qualities I consider essential for interface development.",
      "p2": "My introduction to technology was gradual and natural. Initially, as a hobby, I explored programming through Arduino, incorporating it into my artistic work. Later, while working in audiovisual production, I honed my logic and mastery of technological tools—skills that I rediscovered when diving into Front-End development.",
      "p3": "My passion for Front-End truly emerged when I followed the development of a website for my wife, which sparked my interest in technologies like React and JavaScript. Since then, I have turned that initial curiosity into a profession. Today, I specialize in HTML5, CSS3, JavaScript, React, React Native, Next.js, Git, and GitHub, with expertise in creating functional, intuitive, and visually impactful interfaces.",
      "p4": "With over 7 years of experience in design, audiovisual production, and digital marketing, I bring a creative and user-experience-oriented approach to my projects. Proactive, dynamic, and organized, I am always seeking innovative and effective solutions, combining logic and aesthetics to transform ideas into reality."
    },
    "skills_title": "My skills",
    "skills_items": {
      "javascript": { "text": "javascript", "icon": "javascript" },
      "typescript": { "text": "typescript", "icon": "typescript" },
      "react": { "text": "react js/ts", "icon": "react" },
      "next": { "text": "next.js", "icon": "next" },
      "reactnative": { "text": "react native", "icon": "react" },
      "html": { "text": "html", "icon": "html" },
      "css": { "text": "css", "icon": "css" },
      "tailwind": { "text": "tailwind", "icon": "tailwind" },
      "git": { "text": "git", "icon": "git" },
      "github": { "text": "github", "icon": "github" }
    },
    "another_title": "another complementary skills",
    "another_items": {
      "figma": "figma",
      "photoshop": "photoshop",
      "adobe-xd": "adobe xd",
      "styled-components": "styled-components",
      "macos": "macos",
      "windows": "windows"
    },
    "button": "Get my resume"
  },
  "Footer": {
    "title": "Let's talk.",
    "buttons": { "email": "email me", "whatsapp": "whatsapp" },
    "rights": "Victor   |   All rights reserved"
  },
  "ProjectPage": {
    "projects": {
      "luciana_castellano": {
        "id": "luciana_castellano",
        "title": "Luciana Castellano – Personal Portfolio Website",
        "description": "This project was developed in Next.js 14 to showcase the client's work and services in an elegant, organized, and efficient way. The design, also created by me, aimed to establish a connection with users while serving as both a showcase and search result for the client's services. It also includes pages for sales and lead captures for future potential work.\nThe choice of Next.js 14 was made to ensure scalability, even though the functionalities remain simple. It has proven to be a great decision for future updates and to enhance the website’s SEO performance, optimizing its loading time and search engine ranking.",
        "role": "I was responsible for the entire development and design of this project. My contributions include the creation of a modern and user-friendly design, the integration of required functionalities, and the implementation of SEO strategies to improve visibility and performance in search engines.",
        "technologies": {
          "javascript": true,
          "typescript": false,
          "react": true,
          "next": true,
          "html": true,
          "css": true,
          "tailwind": false,
          "git": true,
          "github": true,
          "reactnative": false
        },
        "image": {
          "img": "/project-luciana-img.jpg",
          "thumb": "/project-luciana-thumb.jpg"
        },
        "projectURL": "https://luciana-castellano.vercel.app",
        "githubURL": "https://github.com/victormerseguel/luciana-castellano-next",
        "show": true
      },
      "videomaker_portfolio": {
        "id": "videomaker_portfolio",
        "title": "Videomaker Portfolio",
        "description": "This project was the beginning of everything. After I started venturing into the world of programming, my first personal project was creating a portfolio for my work as a videomaker. It started as a messy, self-taught, simple project in HTML, CSS, and JavaScript. Over time, it transformed and became more organized, and today it’s part of a larger portfolio built in Next.js 14, utilizing the latest features that it offers.\nSome interesting challenges included: creating a modal for each video with Route Intercepting and Route Parallel so that it was possible to view each project without losing the existing navigation, but also providing a unique route for each project to be accessed directly; using the native Image component for better loading performance and server-side caching, reducing the number of immediate requests when accessing the site and making them only when necessary; and organizing routes since this project is part of a larger application that includes the website we are on right now.\nThis is a project I hold dear because, as mentioned, it’s the beginning of everything and at the same time a diary of my journey and evolution in front-end development.",
        "role": "I was responsible for the entire development of this portfolio. My contributions include transforming it from a simple structure into a fully functional, high-performance website using Next.js 14, implementing routing solutions, optimizing performance, and incorporating SEO techniques.",
        "technologies": {
          "javascript": true,
          "typescript": false,
          "react": true,
          "next": true,
          "html": true,
          "css": true,
          "tailwind": false,
          "git": true,
          "github": true,
          "reactnative": false
        },
        "image": {
          "img": "/project-portfolio-img.jpg",
          "thumb": "/project-portfolio-thumb.jpg"
        },
        "projectURL": "https://victormerseguel.com/film",
        "githubURL": "https://github.com/victormerseguel/victor-portfolio",
        "show": true
      },
      "londe": {
        "id": "londe",
        "title": "L'Onde - Carole Mac Veigh",
        "description": "This React application was built to promote and showcase the services offered by the client. With a modern yet feminine design, the application is simple but effective in conveying the client's offerings.\nKey features include a language selection feature with preferences stored in localStorage for future sessions, integration with EmailJS for form submissions, dynamic content management for easy updates, and SEO techniques such as the inclusion of hreflang attributes for multi-language routes.\nIn the future, there are plans to migrate the app to Next.js in order to further improve SEO and optimize search engine ranking.",
        "role": "I was responsible for the full development of the website, including designing the interface, implementing multi-language support, integrating EmailJS for form submissions, and configuring SEO elements such as hreflang tags for multilingual SEO.",
        "technologies": {
          "javascript": true,
          "typescript": false,
          "react": true,
          "next": false,
          "html": true,
          "css": true,
          "tailwind": false,
          "git": true,
          "github": true,
          "reactnative": false
        },
        "image": {
          "img": "/project-londe-img.jpg",
          "thumb": "/project-londe-thumb.jpg"
        },
        "projectURL": "https://www.guialonde.com",
        "githubURL": "https://github.com/victormerseguel/londe-carolemacveigh",
        "show": true
      },
      "landing_page": {
        "id": "landing_page",
        "title": "Landing Page",
        "description": "This project is a simple landing page, but it stands out in this portfolio because all the creation was done by me, from design to deployment.\nOriginally, this work was done within a larger project entirely built in React. However, due to confidentiality reasons, it was recreated for display purposes.\nThe choice to do it in React was made because it allowed for the creation of separate sections, enabling easy reorganization based on traffic testing and visitor behavior analysis.",
        "role": "",
        "technologies": {
          "javascript": true,
          "typescript": false,
          "react": true,
          "next": false,
          "html": true,
          "css": true,
          "tailwind": false,
          "git": false,
          "github": false,
          "reactnative": false
        },
        "image": {
          "img": "/project-fabuloso-img.jpg",
          "thumb": "/project-fabuloso-thumb.jpg"
        },
        "projectURL": "https://luciana-castellano.vercel.app/o-fabuloso-mundo",
        "githubURL": "https://github.com/victormerseguel/o-fabuloso-mundo",
        "show": true
      },
      "imc_calculator": {
        "id": "imc_calculator",
        "title": "IMC Calculator",
        "description": "The purpose of this work was to exercise and study the similarities and differences between similar technologies and the functionalities of using libraries and frameworks.\nThe project's focus points were the manipulation of input states with basic validations, the logic of calculations, fetching data from a database, and styling according to the obtained results.\nIt is a rather simple project but very interesting for practicing basic concepts and understanding how these technologies work.\nThis project was carried out in two different ways, one in Vanilla JavaScript and the other in React",
        "role": "",
        "technologies": {
          "javascript": true,
          "typescript": false,
          "react": true,
          "next": false,
          "html": true,
          "css": true,
          "tailwind": false,
          "git": false,
          "github": false,
          "reactnative": false
        },
        "image": {
          "img": "/project-imc-img.jpg",
          "thumb": "/project-imc-thumb.jpg"
        },
        "projectURL": "https://imc-calculator-react-psi.vercel.app",
        "githubURL": "https://github.com/victormerseguel/imc_calculator_react",
        "show": true
      },
      "quiz_dev": {
        "id": "quiz_dev",
        "title": "Quiz DEV",
        "description": "This project was created in React, and despite the option to use RouterDOM, it was chosen to work with conditional rendering through a Custom Hook that manages the states of a useReducer and provides a context through the useContext hook.\nThe goal of this work was to exercise knowledge in React using Hooks and explore their possibilities.\nAdditionally, the Quiz offers the choice of 3 themes, with hints for each question, options rendered in random order, visual representation of correct and incorrect answers, score counting, and a final result. All dynamically based on a data file that contains an array of objects with all the necessary information.",
        "role": "",
        "technologies": {
          "javascript": true,
          "typescript": false,
          "react": true,
          "next": false,
          "html": true,
          "css": true,
          "tailwind": false,
          "git": false,
          "github": false,
          "reactnative": false
        },
        "image": {
          "img": "/project-quiz-img.jpg",
          "thumb": "/project-quiz-thumb.jpg"
        },
        "projectURL": "https://quiz-app-react-kohl-phi.vercel.app",
        "githubURL": "https://github.com/victormerseguel/quiz_app_react",
        "show": true
      },
      "iphone14_clone": {
        "id": "iphone14_clone",
        "title": "iPhone 14 - Page Clone",
        "description": "Widely recognized for its design and the excellent user experience Apple offers, I decided to recreate, for study purposes, the page of the iPhone 14 (the latest at the time). Although it's a mostly static page, there were some challenges that I found interesting to tackle. The first one was achieving harmony among the elements on the page, a way to understand and study programming concepts based on references from major companies. The second challenge was attempting to create, with limited knowledge and without the use of any libraries, an infinite carousel that can be seen further down the page. With elements that rotate independently of each other and with interactivity with the mouse and user control.\nThe goal was to get as close as possible to the reference, but some elements needed to be replaced and adapted, such as the fonts used and the removal of some sections.",
        "role": "",
        "technologies": {
          "javascript": true,
          "typescript": false,
          "react": false,
          "next": false,
          "html": true,
          "css": true,
          "tailwind": false,
          "git": false,
          "github": false,
          "reactnative": false
        },
        "image": {
          "img": "/project-iphone14-img.jpg",
          "thumb": "/project-iphone14-thumb.jpg"
        },
        "projectURL": "https://iphone14-clone-vic.vercel.app/",
        "githubURL": "https://github.com/victormerseguel/iphone14_clone",
        "show": true
      },
      "password_generator": {
        "id": "password_generator",
        "title": "Password Generator",
        "description": "This is a simple form that simulates a registration form where the user must enter their data and create a password. However, there is logic in this program that automatically generates a random password to assist the user.\nThis password generator has the possibility of customization, allowing the user to select the quantity of characters that will compose the password, whether there will be letters and/or numbers and/or special characters, making the project more comprehensive and complex in its logic.\nAdditionally, there is a button to copy the generated password to facilitate its use.",
        "role": "",
        "technologies": {
          "javascript": true,
          "typescript": false,
          "react": false,
          "next": false,
          "html": true,
          "css": true,
          "tailwind": false,
          "git": false,
          "github": false,
          "reactnative": false
        },
        "image": {
          "img": "/project-password-img.jpg",
          "thumb": "/project-password-thumb.jpg"
        },
        "projectURL": "https://password-generator-five-nu.vercel.app",
        "githubURL": "https://github.com/victormerseguel/password-generator",
        "show": true
      },
      "animation": {
        "id": "animation",
        "title": "Animation",
        "description": "This project is part of my studies in Creative Programming, where, through JavaScript, shapes, and automation, animations and digital art pieces are created.\nIt is a ve\nry fun and challenging work that originally uses Canvas Sketch Util in its creation, but for this portfolio, it was recreated in Vanilla JavaScript so that it could be deployed directly as code, without needing to be converted into a video.\nIn addition to creating shapes, this project adapts to different screen sizes, being recreated and generating proportional points for each size, always maintaining its visual harmony, regardless of the device being used.",
        "role": "",
        "technologies": {
          "javascript": true,
          "typescript": false,
          "react": false,
          "next": false,
          "html": true,
          "css": true,
          "tailwind": false,
          "git": false,
          "github": false,
          "reactnative": false
        },
        "image": {
          "img": "/project-animation-img.jpg",
          "thumb": "/project-animation-thumb.jpg"
        },
        "projectURL": "https://sketch01.vercel.app",
        "githubURL": "https://github.com/victormerseguel/sketch01",
        "show": true
      },
      "qrcode_generator": {
        "id": "qrcode_generator",
        "title": "QR Code Generator",
        "description": "This is one of the first JavaScript projects I had the opportunity to create in order to study and practice its functionalities. It integrates with an API that, based on text entered in an input, which can be a message or even a URL, generates a QR Code.\nIt is simple but quite interesting!",
        "role": "",
        "technologies": {
          "javascript": true,
          "typescript": false,
          "react": false,
          "next": false,
          "html": true,
          "css": true,
          "tailwind": false,
          "git": false,
          "github": false,
          "reactnative": false
        },
        "image": {
          "img": "/project-qrcode-img.jpg",
          "thumb": "/project-qrcode-thumb.jpg"
        },
        "projectURL": "https://qrcode-generator-seven-virid.vercel.app",
        "githubURL": "https://github.com/victormerseguel/password-generator",
        "show": true
      },
      "advanced_todolist": {
        "id": "advanced_todolist",
        "title": "Advanced ToDo List - Local Storage",
        "description": "This is one of the classics of JavaScript projects where you can create a to-do list with the ability to mark those that have been completed, edit each existing one, and delete.\nHowever, unlike most projects, this one has some unique features such as the search field, allowing filtering of activities by titles or keywords; a filter to separate completed tasks, to-dos, and all of them; and saving to Local Storage, so that the data persists upon page reload and browser closure.",
        "role": "",
        "technologies": {
          "javascript": true,
          "typescript": false,
          "react": false,
          "next": false,
          "html": true,
          "css": true,
          "tailwind": false,
          "git": false,
          "github": false,
          "reactnative": false
        },
        "image": {
          "img": "/project-todo-img.jpg",
          "thumb": "/project-todo-thumb.jpg"
        },
        "projectURL": "https://advanced-todo-list-localstorage.vercel.app",
        "githubURL": "https://github.com/victormerseguel/advanced_todo_list_localstorage",
        "show": true
      },
      "studio_espectro": {
        "id": "studio_espectro",
        "title": "Studio Espectro",
        "description": "This is a very simple application, but with a unique characteristic. The design was created by a visual artist rather than a UI/UX designer, resulting in an interesting layout that is somewhat complex to translate into code, as it does not follow conventional market logic.\nThe challenge was to create clean code with proper semantics and best practices, while also ensuring it was pixel-perfect, without any distortions or alterations to the original artwork.",
        "role": "",
        "technologies": {
          "javascript": true,
          "typescript": false,
          "react": true,
          "next": true,
          "html": true,
          "css": true,
          "tailwind": false,
          "git": false,
          "github": false,
          "reactnative": false
        },
        "image": {
          "img": "/project-studioespectro.jpg",
          "thumb": "/project-studioespectro.jpg"
        },
        "projectURL": "https://studioespectro.com",
        "githubURL": "https://github.com/studioespectro/studio_espectro",
        "show": false
      },
      "boxshadow_generator": {
        "id": "boxshadow_generator",
        "title": "Box-Shadow Generator",
        "description": "This is a utility project that is widely used in Front-End development, specifically for design creation.\nUsing sliders and a real-time viewer, we can change values of properties that are part of the Box-Shadow and see the results immediately, greatly facilitating the implementation of this property.\nThe result of the control change generates a rule that just needs to be copied and added to the style rule to be used in the final project.",
        "role": "",
        "technologies": {
          "javascript": true,
          "typescript": false,
          "react": false,
          "next": false,
          "html": true,
          "css": true,
          "tailwind": false,
          "git": false,
          "github": false,
          "reactnative": false
        },
        "image": {
          "img": "/project-boxshadow-img.jpg",
          "thumb": "/project-boxshadow-thumb.jpg"
        },
        "projectURL": "https://box-shadow-generator-gamma.vercel.app",
        "githubURL": "https://github.com/victormerseguel/box-shadow_generator",
        "show": true
      },
      "instagramlogin_clone": {
        "id": "instagramlogin_clone",
        "title": "Instagram Login - Page Clone",
        "description": "The purpose of this project is to study and analyze interfaces, not only for the code itself (which, in this case, is quite simple) but also for design concepts such as colors, layouts, sizes, and so on. Studying interfaces from major companies provides exposure to the work of top professionals and the best practices in the industry.\nIn this particular project, the focus is on HTML and CSS, with a small amount of JavaScript added to create the phone screen change in order to reproduce the original animation from that time.",
        "role": "",
        "technologies": {
          "javascript": true,
          "typescript": false,
          "react": false,
          "next": false,
          "html": true,
          "css": true,
          "tailwind": false,
          "git": false,
          "github": false,
          "reactnative": false
        },
        "image": {
          "img": "/project-instagram-img.jpg",
          "thumb": "/project-instagram-thumb.jpg"
        },
        "projectURL": "https://instagram-login-clone-vert.vercel.app",
        "githubURL": "https://github.com/victormerseguel/instagram_login_clone",
        "show": true
      }
    },
    "nav": {
      "name": "Victor Merseguel",
      "job": "Front End Developer",
      "button": "Get in touch"
    },
    "about": {
      "title": "About project",
      "role": "My role",
      "technologies": "Technologies",
      "buttons": {
        "1": "View Project",
        "2": "Repository"
      }
    }
  }
}
